init.org
** Boot
:PROPERTIES:
:CUSTOM_ID: cfg-boot
:END:

We also load the common lisp libraries here.

#+BEGIN_SRC emacs-lisp :tangle config/init-boot.el
  (eval-when-compile (require 'cl))
#+END_SRC

Load any manually installed packages on the =elisp/= directory.

#+BEGIN_SRC emacs-lisp :tangle config/init-boot.el
  (let ((base (concat user-emacs-directory "elisp/")))
    (when (and (not (file-exists-p base))
               (y-or-n-p
                (format "Directory `%s' does not exist! Create it?"
                        base)))
      (make-directory base t))
    (add-to-list 'load-path base)
    (dolist (dir (directory-files base t "^[^.]"))
      (when (file-directory-p dir)
        (add-to-list 'load-path dir))))
#+END_SRC

This handy macro creates a new buffer with the name =*Load Times*= and shows a
moderately detailed information about the load time of TARGET. It is used here
to show the load times of packages loaded with =require= or =load=.

#+BEGIN_SRC emacs-lisp :tangle config/init-boot.el
  (defmacro /boot/measure-load (target &rest body)
    (declare (indent defun))
    `(let ((elapsed)
           (start (current-time)))
       (prog1
           ,@body
         (with-current-buffer (get-buffer-create "*Load Times*")
           (when (= 0 (buffer-size))
             (insert (format "| %-60s | %-23s | elapsed  |\n" "feature" "timestamp"))
             (insert "|--------------------------------------------------------------+-------------------------+----------|\n"))
           (goto-char (point-max))
           (setq elapsed (float-time (time-subtract (current-time) start)))
           (insert (format "| %-60s | %s | %f |\n"
                           ,target
                           (format-time-string "%Y-%m-%d %H:%M:%S.%3N" (current-time))
                           elapsed))))))

  (defadvice load (around dotemacs activate)
    (/boot/measure-load file ad-do-it))

  (defadvice require (around dotemacs activate)
    (if (memq feature features)
        ad-do-it
      (/boot/measure-load feature ad-do-it)))

  (defmacro bind (&rest commands)
    "Convenience macro which creates a lambda interactive command."
    `(lambda (arg)
       (interactive "P")
       ,@commands))
#+END_SRC

Here are the macros mentioned on the [[#intro][introduction]] section.

#+BEGIN_SRC emacs-lisp :tangle config/init-boot.el
  (defun require-package (package &optional min-version no-refresh)
    "Install given PACKAGE, optionally requiring MIN-VERSION.
  If NO-REFRESH is non-nil, the available package lists will not be
  re-downloaded in order to locate PACKAGE."
    (if (or (package-installed-p package min-version)
            (require package nil 'noerror))
        t
      (if (or (assoc package package-archive-contents) no-refresh)
          (if (boundp 'package-selected-packages)
              ;; Record this as a package the user installed explicitly
              (package-install package nil)
            (package-install package))
        (progn
          (package-refresh-contents)
          (require-package package min-version t)))))

  (defun maybe-require-package (package &optional min-version no-refresh)
    "Try to install PACKAGE, and return non-nil if successful.
  In the event of failure, return nil and print a warning message.
  Optionally require MIN-VERSION.  If NO-REFRESH is non-nil, the
  available package lists will not be re-downloaded in order to
  locate PACKAGE."
    (condition-case err
        (require-package package min-version no-refresh)
      (error
       (message "Couldn't install optional package `%s': %S" package err)
       nil)))
  (unless (fboundp 'with-eval-after-load)
    (defmacro with-eval-after-load (file &rest body)
      (declare (indent 1))
      `(eval-after-load ,file (lambda () ,@body))))

  (defmacro after (feature &rest body)
    "Executes BODY after FEATURE has been loaded.

  FEATURE may be any one of:
      'evil            => (with-eval-after-load 'evil BODY)
      \"evil-autoloads\" => (with-eval-after-load \"evil-autolaods\" BODY)
      [evil cider]     => (with-eval-after-load 'evil
                            (with-eval-after-load 'cider
                              BODY))
  "
    (declare (indent 1))
    (cond
     ((vectorp feature)
      (let ((prog (macroexp-progn body)))
        (cl-loop for f across feature
                 do
                 (progn
                   (setq prog (append `(',f) `(,prog)))
                   (setq prog (append '(with-eval-after-load) prog))))
        prog))
     (t
      `(with-eval-after-load ,feature ,@body))))
#+END_SRC

This macro is to lazily install a major mode like described in [[#lazy-major-modes][Lazy major modes]].

#+BEGIN_SRC emacs-lisp :tangle config/init-boot.el
  (defmacro /boot/lazy-major-mode (pattern mode)
    "Defines a new major-mode matched by PATTERN, installs MODE if
  necessary, and activates it."
    `(add-to-list 'auto-mode-alist
                  '(,pattern . (lambda ()
                                 (require-package ,mode)
                                 (,mode)))))

  (defmacro /boot/delayed-init (&rest body)
    "Runs BODY after idle for a predetermined amount of time."
    `(run-with-idle-timer
      0.5
      nil
      (lambda () ,@body)))

  (provide 'init-boot)
#+END_SRC

This function is to create a ask to create a directory if trying to access a
non-existing directory.

#+BEGIN_SRC emacs-lisp :tangle config/init-boot.el
  (defun /boot/create-non-existent-directory (&optional dir)
    "When trying to access non-existing directories, ask to create them.
  If DIR is provided, ask to create DIR."
    (let ((parent-directory (or (bound-and-true-p dir)
                                (file-name-directory buffer-file-name))))
      (when (and (not (file-exists-p parent-directory))
                 (y-or-n-p (format "Directory `%s' does not exist! Create it?"
                                   parent-directory)))
        (make-directory parent-directory t))))

  (add-to-list 'find-file-not-found-functions
               #'/boot/create-non-existent-directory)
#+END_SRC

