init.org
** Util
:PROPERTIES:
:CUSTOM_ID: cfg-util
:END:

Some useful functions. They are pretty much self documented, so there ain't much
more I could say about it.

#+BEGIN_SRC emacs-lisp :tangle config/init-util.el
  (defun /util/window-killer ()
    "Closes the window, and deletes the buffer if it's the last window open."
    (interactive)
    (if (> buffer-display-count 1)
        (if (= (length (window-list)) 1)
            (kill-buffer)
          (delete-window))
      (kill-buffer-and-window)))

  (defun /util/minibuffer-keyboard-quit ()
    "Abort recursive edit.
  In Delete Selection mode, if the mark is active, just deactivate it;
  then it takes a second \\[keyboard-quit] to abort the minibuffer."
    (interactive)
    (if (and delete-selection-mode transient-mark-mode mark-active)
        (setq deactivate-mark t)
      (when (get-buffer "*Completions*") (delete-windows-on "*Completions*"))
      (abort-recursive-edit)))

  (defun /util/set-transparency (alpha)
    "Sets the transparency of the current frame."
    (interactive "nAlpha: ")
    (set-frame-parameter nil 'alpha alpha))

  (defun /util/copy-file-name-to-clipboard ()
    "Copy the current buffer file name to the clipboard."
    (interactive)
    (let ((filename (if (equal major-mode 'dired-mode)
                        default-directory
                      (buffer-file-name))))
      (when filename
        (kill-new filename)
        (message "Copied buffer file name '%s' to the clipboard." filename))))

  (defun /util/eval-and-replace ()
    "Replace the preceding sexp with its value."
    (interactive)
    (let ((value (eval (preceding-sexp))))
      (backward-kill-sexp)
      (insert (format "%s" value))))

  (defun /util/rename-current-buffer-file ()
    "Renames current buffer and file it is visiting."
    (interactive)
    (let ((filename (buffer-file-name)))
      (if (not (and filename (file-exists-p filename)))
          (message "Buffer is not visiting a file!")
        (let ((new-name (read-file-name "New name: " filename)))
          (cond
           ((vc-backend filename) (vc-rename-file filename new-name))
           (t
            (rename-file filename new-name t)
            (set-visited-file-name new-name t t)))))))

  (defun /util/delete-current-buffer-file ()
    "Kill the current buffer and deletes the file it is visiting."
    (interactive)
    (let ((filename (buffer-file-name)))
      (when filename
        (if (vc-backend filename)
            (vc-delete-file filename)
          (when (y-or-n-p (format "Are you sure you want to delete %s? " filename))
            (delete-file filename)
            (message "Deleted file %s" filename)
            (kill-buffer))))))

  (defun /util/goto-scratch-buffer ()
    "Create a new scratch buffer."
    (interactive)
    (switch-to-buffer (get-buffer-create "*scratch*")))

  (defun /util/insert-last-kbd-macro ()
    (interactive)
    (name-last-kbd-macro 'my-last-macro)
    (insert-kbd-macro 'my-last-macro))

  (defun /util/set-buffer-to-unix-format ()
    "Converts the current buffer to UNIX file format."
    (interactive)
    (set-buffer-file-coding-system 'undecided-unix nil))

  (defun /util/set-buffer-to-dos-format ()
    "Converts the current buffer to DOS file format."
    (interactive)
    (set-buffer-file-coding-system 'undecided-dos nil))

  (defun /util/find-file-as-root (file)
    "Edits a file as root."
    (interactive "f")
    (find-file-other-window (concat "/sudo:root@localhost:" file)))

  (defun /util/tangle-init ()
    (interactive)
    "If the current buffer is init.org' the code-blocks are
  tangled, and the tangled file is compiled."
    (when (equal (buffer-file-name)
                 (expand-file-name (concat user-emacs-directory "init.org")))
      ;; Avoid running hooks when tangling.
      (let ((prog-mode-hook nil))
        (org-babel-tangle)
        (byte-compile-file (concat user-emacs-directory "init.el")))))

  (provide 'init-util)
#+END_SRC

** Evil
:PROPERTIES:
:CUSTOM_ID: cfg-evil
:END:

Probably my most used packages, by far.

Here we set some variables of things that should not start as =evil-mode= (kinda
contradictory isn't it?) because =evil= is awesome but ain't perfect yet.

#+BEGIN_SRC emacs-lisp :tangle config/init-evil.el
  (defvar dotemacs-evil/emacs-state-hooks
    '(org-log-buffer-setup-hook
      org-capture-mode-hook)
    "List of hooks to automatically start up in Evil Emacs state.")

  (defvar dotemacs-evil/emacs-state-major-modes
    '(calculator-mode
      makey-key-mode)
    "List of major modes that should default to Emacs state.")

  (defvar dotemacs-evil/emacs-state-minor-modes
    '(git-commit-mode
      magit-blame-mode)
    "List of minor modes that when active should switch to Emacs state.")

  (defvar dotemacs-evil/emacs-insert-mode nil
    "If non-nil, insert mode will act as Emacs state.")
#+END_SRC

Some variable configuration for =evil= to feel more like (n)vim.

#+BEGIN_SRC emacs-lisp :tangle config/init-evil.el
  (setq evil-search-module 'isearch-regexp)
  (setq evil-magic 'very-magic)
  (setq evil-shift-width (symbol-value 'tab-width))
  (setq evil-regexp-search t)
  (setq evil-search-wrap t)
  (setq evil-want-C-i-jump t)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-fine-undo nil)
  (setq evil-want-integration nil)
  (setq evil-want-abbrev-on-insert-exit nil)
  (setq evil-want-abbrev-expand-on-insert-exit nil)
  ;; move evil tag to beginning of modeline
  (setq evil-mode-line-format '(before . mode-line-front-space))
#+END_SRC

I usually know in what =evil= state I'm in by the cursor color because of the
configuration.

#+BEGIN_SRC emacs-lisp :tangle config/init-evil.el
  (setq evil-emacs-state-cursor '("red" box))
  (setq evil-motion-state-cursor '("white" box))
  (setq evil-normal-state-cursor '("magenta" box))
  (setq evil-visual-state-cursor '("orange" box))
  (setq evil-insert-state-cursor '("red" bar))
  (setq evil-replace-state-cursor '("red" hbar))
  (setq evil-operator-state-cursor '("red" hollow))
#+END_SRC

Here is where I actually start =evil= after setting some more variables and
hooks. Also in this code snippet is where all of the lists of default states for
some modes set above are actually set with a common lisp loop. I've also added,
in the end of this code block, and advice to indent every time we use =o= or
=O=.

#+BEGIN_SRC emacs-lisp :tangle config/init-evil.el
  (add-hook 'evil-jumps-post-jump-hook #'recenter)

  (require-package 'evil)
  (require 'evil)
  (evil-mode)

  (cl-loop for mode in dotemacs-evil/emacs-state-minor-modes
           do (let ((hook (concat (symbol-name mode) "-hook")))
                (add-hook (intern hook) (lambda ()
                                          (if ,mode
                                              (evil-emacs-state)
                                            (evil-normal-state))))))

  (cl-loop for hook in dotemacs-evil/emacs-state-hooks
           do (add-hook hook #'evil-emacs-state))

  (cl-loop for mode in dotemacs-evil/emacs-state-major-modes
           do (evil-set-initial-state mode 'emacs))

  (after 'evil-common
    (evil-put-property 'evil-state-properties 'normal   :tag " NORMAL ")
    (evil-put-property 'evil-state-properties 'insert   :tag " INSERT ")
    (evil-put-property 'evil-state-properties 'visual   :tag " VISUAL ")
    (evil-put-property 'evil-state-properties 'motion   :tag " MOTION ")
    (evil-put-property 'evil-state-properties 'emacs    :tag " EMACS ")
    (evil-put-property 'evil-state-properties 'replace  :tag " REPLACE ")
    (evil-put-property 'evil-state-properties 'operator :tag " OPERATOR "))

  (when dotemacs-evil/emacs-insert-mode
    (defalias 'evil-insert-state 'evil-emacs-state)
    (define-key evil-emacs-state-map (kbd "<escape>") 'evil-normal-state))

  (unless (display-graphic-p)
    (evil-esc-mode 1))
#+END_SRC

Here is the configuration for the comment package. And some more additional
packages to help integrate =evil= into the most modes possible.

#+BEGIN_SRC emacs-lisp :tangle config/init-evil.el
  (after 'magit
    (require-package 'evil-magit)
    (require 'evil-magit)
    (evil-magit-init))

  (after 'org
    (require-package 'evil-org)
    (require 'evil-org)
    (add-hook 'org-mode-hook #'evil-org-mode)
    (add-hook 'evil-org-mode-hook
              (lambda ()
                (evil-org-set-key-theme))))

  (after 'vimish-fold
    (require-package 'evil-vimish-fold)
    (require 'evil-vimish-fold)
    (evil-vimish-fold-mode t))

  (require-package 'evil-matchit)
  (defun evilmi-customize-keybinding ()
    (evil-define-key 'normal evil-matchit-mode-map
      "%" 'evilmi-jump-items))
  (global-evil-matchit-mode t)

  (require-package 'evil-numbers)
  (require 'evil-numbers)
#+END_SRC

I also use [[https://github.com/emacs-evil/evil-collection][=evil-collection=]], a set of keybindings for =evil-mode=.

#+BEGIN_SRC emacs-lisp :tangle config/init-evil.el
  (after 'evil
    (require-package 'evil-collection)
    (setq evil-collection-setup-minibuffer t)
    (setq evil-collection-company-use-tng t)
    (evil-collection-init))

  (defadvice evil-ex-search-next (after dotemacs activate)
    (recenter))

  (defadvice evil-ex-search-previous (after dotemacs activate)
    (recenter))

  (provide 'init-evil)
#+END_SRC

