init.org
** Helm
   :PROPERTIES:
   :CUSTOM_ID: cfg-helm
   :END:

Helm is a /Emacs incremental completion and selection narrowing framework/
https://emacs-helm.github.io/helm.

#+BEGIN_QUOTE
People often think helm is just something like [[https://www.emacswiki.org/emacs/InteractivelyDoThings][=ido=]] but displaying
completion in a vertical layout instead of an horizontal one, it is not,
helm is much more powerful than that.

  - Helm is able to complete multiple lists dispatched in different sources
    against a pattern.

  - Helm allows executing an unlimited number of actions on candidates.

  - Helm allows marking candidates to execute chosen action against this set of
    candidates.
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle config/init-helm.el
  (require-package 'helm)
  (require 'helm)

  (setq helm-bookmark-show-location t)
  (setq helm-buffer-max-length 40)
  (setq helm-split-window-inside-p t)
  (setq helm-mode-fuzzy-match t)
  (setq helm-ff-file-name-history-use-recentf t)
  (setq helm-ff-skip-boring-files t)
  (setq helm-follow-mode-persistent t)

  (after 'helm-source
    (defun /helm/make-source (f &rest args)
      (let ((source-type (cadr args))
            (props (cddr args)))
        (unless (child-of-class-p source-type 'helm-source-async)
          (plist-put props :fuzzy-match t))
        (apply f args)))
    (advice-add 'helm-make-source :around '/helm/make-source))
#+END_SRC

Helm also has a lot of other packages to integrate it to other packages and
parts of Emacs that the default package doesn't cover. Here are some of those.

#+BEGIN_SRC emacs-lisp :tangle config/init-helm.el
  (after 'helm
    (require-package 'helm-descbinds)

    (require-package 'helm-flx)
    (helm-flx-mode t)

    (require-package 'helm-dash)
    (setq helm-dash-browser-func 'eww)

    (require-package 'helm-ag)
    (setq helm-ag-fuzzy-match t)
    (setq helm-ag-use-agignore t)
    (setq helm-ag-ignore-patterns dotemacs-globally-ignored-directories)
    (after 'helm-ag
      (cond ((executable-find "ag")
             t)
            ((executable-find "pt")
             (setq helm-ag-base-command "pt -e --nogroup --nocolor"))
            ((executable-find "ack")
             (setq helm-ag-base-command "ack --nogroup --nocolor"))))

    (setq helm-swoop-pre-input-function #'ignore)
    (setq helm-swoop-use-line-number-face t)
    (setq helm-swoop-split-with-multiple-windows t)
    (setq helm-swoop-speed-or-color t)
    (setq helm-swoop-use-fuzzy-match t)
    (require-package 'helm-swoop)

    (after "projectile-autoloads"
      (require-package 'helm-projectile))

    (require-package 'helm-tramp)

    ;; take between 10-30% of screen space
    (setq helm-autoresize-min-height 10)
    (setq helm-autoresize-max-height 30)
    (helm-autoresize-mode t))
#+END_SRC

Start =helm= with the default =find-file= and =M-x= functions to be
=helm='s alternatives. And also start =helm= on idle time
(=delayed-init=).

#+BEGIN_SRC emacs-lisp :tangle config/init-helm.el
  (/boot/delayed-init
   (progn
     (global-set-key [remap execute-extended-command] #'helm-M-x)
     (global-set-key [remap find-file] #'helm-find-files)
     (helm-mode t)))

  (provide 'init-helm)
#+END_SRC

** Bindings
:PROPERTIES:
:CUSTOM_ID: cfg-bindings
:END:

This is one of the most crucial points of the setup, as explained in the
[[#bindings][bindings]] section.

=which-key= is a very helpful tool to help you remember bindings. If you type a
prefix key and stay idle for more than 0.2s without pressing another key,
=which-key= will show you every possible binding with its related function
starting with the prefix you pressed.

#+BEGIN_SRC emacs-lisp :tangle config/init-bindings.el
  (require-package 'which-key)
  (require 'which-key)
  (setq which-key-idle-delay 0.2)
  (setq which-key-min-display-lines 3)
  (setq which-key-max-description-length 20)
  (setq which-key-max-display-columns 6)
  (which-key-mode)
#+END_SRC

These macros are to help me remap keys.

#+BEGIN_SRC emacs-lisp :tangle config/init-bindings.el
  (defmacro /bindings/define-prefix-keys (keymap prefix &rest body)
    (declare (indent defun))
    `(progn
       ,@(cl-loop for binding in body
                  collect
                  `(let ((seq ,(car binding))
                         (func ,(cadr binding))
                         (desc ,(caddr binding)))
                     (define-key ,keymap (kbd seq) func)
                     (when desc
                       (which-key-add-key-based-replacements
                         (if ,prefix
                             (concat ,prefix " " seq)
                           seq)
                         desc))))))

  (defmacro /bindings/define-keys (keymap &rest body)
    (declare (indent defun))
    `(/bindings/define-prefix-keys ,keymap nil ,@body))

  (defmacro /bindings/define-key (keymap sequence binding &optional description)
    (declare (indent defun))
    `(/bindings/define-prefix-keys ,keymap nil
       (,sequence ,binding ,description)))
#+END_SRC

With this, pressing =ESC= actually leaves the minibuffer. Also, like
in Vim's "minibuffer", pressing =C-w= deletes a word back. This is now
commented because I have =evil-collection-setup-minibuffer= activated
by default, which makes the minibuffer behave like a normal emacs
buffer with =evil= activated.

#+BEGIN_SRC emacs-lisp :tangle config/init-bindings.el
  ;; escape minibuffer
  ;; (define-key minibuffer-local-map [escape]
  ;;   '/util/minibuffer-keyboard-quit)
  ;; (define-key minibuffer-local-ns-map [escape]
  ;;   '/util/minibuffer-keyboard-quit)
  ;; (define-key minibuffer-local-completion-map [escape]
  ;;   '/util/minibuffer-keyboard-quit)
  ;; (define-key minibuffer-local-must-match-map [escape]
  ;;   '/util/minibuffer-keyboard-quit)
  ;; (define-key minibuffer-local-isearch-map [escape]
  ;;   '/util/minibuffer-keyboard-quit)

  ;; (define-key minibuffer-local-map (kbd "C-w") 'backward-kill-word)
#+END_SRC

First I map =C-S-n= to create a new below where the point is, and
=C-S-o= to create one above. The rest is just more configuration
regarding a bunch of packages and modes.

#+BEGIN_SRC emacs-lisp :tangle config/init-bindings.el
  (global-set-key (kbd "C-x C-/") #'/util/find-file-as-root)

  (global-set-key (kbd "M-;") #'comment-line)

  (after "expand-region-autoloads"
    (global-set-key (kbd "C-=") #'er/expand-region))

  ;; mouse scrolling in terminal
  (unless (display-graphic-p)
    (global-set-key [mouse-4] (bind (scroll-down 1)))
    (global-set-key [mouse-5] (bind (scroll-up 1))))

  (after 'compile
    (define-key compilation-mode-map (kbd "j") 'compilation-next-error)
    (define-key compilation-mode-map (kbd "k") 'compilation-previous-error))
#+END_SRC

I like using =helm= to pretty much anything I can, so I set most of the common
variables as =helm= commands. I also find it useful to remap the
=helm-command-prefix= to =C-c h=, because it is easy to mistype =C-x C-c= with
the default prefix. I also map =M-!= and =C-!= to use =eshell= instead of the
default.

#+BEGIN_SRC emacs-lisp :tangle config/init-bindings.el
  (after 'helm
    (require 'helm-config)
    (global-set-key (kbd "C-c h") #'helm-command-prefix)
    (global-unset-key (kbd "C-x c"))
    (global-set-key (kbd "C-h a") #'helm-apropos)
    (global-set-key (kbd "C-x b") #'helm-buffers-list)
    (global-set-key (kbd "C-x C-b") #'helm-mini)
    (global-set-key (kbd "C-x C-f") #'helm-find-files)
    (global-set-key (kbd "C-x r b") #'helm-bookmarks)
    (global-set-key (kbd "M-x") #'helm-M-x)
    (global-set-key (kbd "M-y") #'helm-show-kill-ring)
    (global-set-key (kbd "M-:") #'helm-eval-expression-with-eldoc)
    (define-key helm-map (kbd "<tab>") #'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-z") #'helm-select-action)

    (after "helm-ag-autoloads"
      (global-set-key (kbd "C-c h g") #'helm-do-ag))

    (after "helm-swoop-autoloads"
      (global-set-key (kbd "C-c h S") #'helm-swoop))

    (after "helm-tramp-autoloads"
      (global-set-key (kbd "C-x t") #'helm-tramp)))

  (global-set-key (kbd "M-!") #'eshell-command)
  (global-set-key (kbd "C-!") #'/eshell/new-window)
#+END_SRC

These bindings are mostly regarding third party packages, that's why most of
them are wrapped in a =after=. This first one is worth explaining; when using
=company=, if you are on the completion pop-up and hit the tab key, it will
first look for a snippet from =yasnippet= and if there is none it will use the
current selection as the Completion. For example, if you type =def= on any
=elisp= mode, it will have tons of completion candidates, but it is also a
snippet for =defun=, so if you hit tab, it will actually trigger the =defun=
snippet.

#+BEGIN_SRC emacs-lisp :tangle config/init-bindings.el
  (after 'company
    (after "yasnippet-autoloads"
      (define-key company-active-map (kbd "<tab>")
        (bind (when (null (yas-expand))
                (company-complete-selection))))))

  (define-key company-active-map (kbd "RET") 'company-complete-selection)

  (after 'magit
    (global-set-key (kbd "C-x g") #'magit-status)
    (global-set-key (kbd "C-x M-g") #'magit-dispatch-popup)

    (after 'magit-todos
      (define-key magit-todos-section-map (kbd "j") 'evil-next-line)
      (define-key magit-todos-section-map (kbd "k") 'evil-previous-line)))

    (after 'projectile
      (define-key projectile-mode-map (kbd "C-c p") #'projectile-command-map)
      (global-set-key (kbd "C-S-p") #'projectile-switch-project))

  (after 'evil
    (define-key evil-normal-state-map (kbd "!") #'/eshell/new-window)
    (define-key evil-visual-state-map (kbd "!") #'/eshell/new-window)
    (define-key evil-motion-state-map (kbd "!") #'/eshell/new-window))

  (/bindings/define-keys (current-global-map)
    ("C-c c" #'org-capture)
    ("C-c a" #'org-agenda)
    ("C-c l" #'org-store-link)
    ("C-c s" #'/util/goto-scratch-buffer)
    ("C-c e" #'/util/eval-and-replace)
    ("C-c t" #'/eshell/new-window))

  (/bindings/define-keys (current-global-map)
    ("C-x c" #'calculator)
    ("C-x C" #'calendar)
    ("C-x C-k" #'kill-this-buffer)
    ("C-x p" #'proced))

  (global-set-key (kbd "<M-f7>") (bind (profiler-start 'cpu+mem)))
  (global-set-key (kbd "<M-f6>") (bind (profiler-report) (profiler-stop)))

  (provide 'init-bindings)
#+END_SRC

Some packages have specific bindings and/or too much bindings to be on the
=config/init-bindings.el= file, so they have their own.

*** Evil bindings
    :PROPERTIES:
    :CUSTOM_ID: cfg-bindings-evil
    :END:

Since it is my most used package it makes total sense that is has it's own file.

#+BEGIN_SRC emacs-lisp :tangle config/bindings/bind-evil.el
  (after 'evil
    (/bindings/define-keys evil-normal-state-map ("g d" #'dumb-jump-go))

    (require-package 'key-chord)
    (key-chord-mode 1)
    (key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
    (key-chord-define evil-insert-state-map "kj" 'evil-normal-state)

    (after "evil-numbers-autoloads"
      (/bindings/define-key evil-normal-state-map "C-a" #'evil-numbers/inc-at-pt)
      (/bindings/define-key evil-normal-state-map "C-S-a" #'evil-numbers/dec-at-pt))

    (after "company-autoloads"
      (define-key evil-insert-state-map (kbd "TAB")
        #'company-indent-or-complete-common))

    (/bindings/define-keys evil-normal-state-map
      ("SPC" ":noh")
      ("C-b" #'evil-scroll-up)
      ("C-f" #'evil-scroll-down))

    (after 'evil-evilified-state
      (/bindings/define-keys evil-evilified-state-map
        ("C-w h" #'evil-window-left)
        ("C-w j" #'evil-window-down)
        ("C-w h" #'evil-window-up)
        ("C-w l" #'evil-window-right)))

    (/bindings/define-keys evil-normal-state-map
      ("C-w h" #'evil-window-left)
      ("C-w j" #'evil-window-down)
      ("C-w k" #'evil-window-up)
      ("C-w l" #'evil-window-right))

    (/bindings/define-key evil-normal-state-map "Y" "y$"))

  (provide 'init-bindings-evil)
#+END_SRC

