init.org
** Eyecandy
:PROPERTIES:
:CUSTOM_ID: cfg-eyecandy
:END:

Some eyecandy is good.

Color theme config and font config.

#+BEGIN_SRC emacs-lisp :tangle config/init-eyecandy.el
  (require-package 'solarized-theme)
  (setq solarized-scale-org-headlines nil)
  (setq x-underline-at-descent-line t)
  (require 'solarized-theme)

  (require-package 'monokai-theme)

  (require-package 'gruvbox-theme)

  (load-theme 'manoj-dark t)

  ;; change fringe background and foreground color
  (set-face-attribute 'fringe nil
                      :background (face-background 'default)
                      :foreground (face-foreground 'default))

  ;; make comments grey (manoj-dark)
  (set-face-foreground 'font-lock-comment-face "dimgray")
  (set-face-foreground 'font-lock-comment-delimiter-face "dimgray")

  ;; disable the bigger scale on bold function fonts (manoj-dark)
  (set-face-attribute 'font-lock-function-name-face nil :height 1.0)

  ;; change line number color (manoj-dark)
  (after 'linum
    (set-face-attribute 'linum nil :foreground "gold"))

  ;; change mode-line's font size and foreground and background
  (set-face-attribute 'mode-line nil
                      :height 1.0
                      :background (face-foreground 'default)
                      :foreground (face-background 'default))
  (set-face-attribute 'mode-line-buffer-id nil
                      :height 1.0
                      :background (face-foreground 'default)
                      :foreground (face-background 'default))

  ;; default font
  (add-to-list 'default-frame-alist '(font . "DejaVu Sans Mono-14"))

  ;; increase, decrease and adjust font size
  (global-set-key (kbd "C-+") #'text-scale-increase)
  (global-set-key (kbd "C--") #'text-scale-decrease)
  (global-set-key (kbd "C-0") #'text-scale-adjust)
#+END_SRC

Also there is some mode to display stuff in the modeline that are very useful.

#+BEGIN_SRC emacs-lisp :tangle config/init-eyecandy.el
  (line-number-mode t)
  (column-number-mode t)
  (size-indication-mode t)
#+END_SRC

Here is the configuration regarding the folding method.

#+BEGIN_SRC emacs-lisp :tangle config/init-eyecandy.el
  (require-package 'vimish-fold)
  (require 'vimish-fold)
  (vimish-fold-global-mode t)
#+END_SRC

The =diminish= package hides minor modes from the modeline.

#+BEGIN_SRC emacs-lisp :tangle config/init-eyecandy.el
  ;; (require-package 'delight)

  ;; (delight '((auto-fill-mode nil t)
  ;;            (auto-revert-mode nil autorevert)
  ;;            (abbrev-mode nil abbrev)
  ;;            (whitespace-mode nil whitespace)
  ;;            (helm-mode nil helm-mode)
  ;;            (flyspell-mode nil flyspell)
  ;;            (projectile-mode nil projectile)
  ;;            (yas-minor-mode nil yasnippet)
  ;;            (undo-tree-mode nil undo-tree)
  ;;            (which-key-mode nil which-key)
  ;;            (company-mode nil company)
  ;;            (aggressive-indent-mode nil aggressive-indent)
  ;;            (evil-org-mode nil evil-org)
  ;;            (evil-vimish-fold-mode nil evil-vimish-fold)
  ;;            (eldoc-mode nil eldoc)
  ;;            (highlight-symbol-mode nil hightlight-symbol)
  ;;            ))

  ;; (delight 'server-buffer-clients nil 'server)
  ;; (delight 'auto-fill-function nil t)

  (require-package 'diminish)
  (require 'diminish)

  (diminish 'visual-line-mode)
  (diminish 'auto-fill-function)
  (after 'whitespace
    (diminish 'global-whitespace-mode)
    (diminish 'whitespace-mode))
  (after 'org-indent (diminish 'org-indent-mode))
  (after 'outline (diminish 'outline-minor-mode))
  (after 'aggressive-indent (diminish 'aggressive-indent-mode))
  (after 'autorevert (diminish 'auto-revert-mode))
  (after 'abbrev (diminish 'abbrev-mode))
  (after 'subword (diminish 'subword-mode))
  (after 'color-identifiers-mode (diminish 'color-identifiers-mode))
  (after 'company (diminish 'company-mode))
  (after 'counsel (diminish 'counsel-mode))
  (after 'eldoc (diminish 'eldoc-mode))
  (after 'elisp-slime-nav (diminish 'elisp-slime-nav-mode))
  (after 'flycheck (diminish 'flycheck-mode))
  (after 'flyspell (diminish 'flyspell-mode))
  (after 'git-gutter+ (diminish 'git-gutter+-mode))
  (after 'helm-mode (diminish 'helm-mode))
  (after 'hideshow (diminish 'hs-minor-mode))
  (after 'highlight-symbol (diminish 'highlight-symbol-mode))
  (after 'indent-guide (diminish 'indent-guide-mode))
  (after 'ivy (diminish 'ivy-mode))
  (after 'page-break-lines (diminish 'page-break-lines-mode))
  (after 'projectile (diminish 'projectile-mode))
  (after 'undo-tree (diminish 'undo-tree-mode))
  (after 'which-key (diminish 'which-key-mode))
  (after 'yasnippet (diminish 'yas-minor-mode))
  (after 'evil-org (diminish 'evil-org-mode))
  (after 'evil-vimish-fold (diminish 'evil-vimish-fold-mode))
  (after 'proof-site (diminish 'proof-active-buffer-fake-minor-mode))
  (after "intero-autoloads" (diminish 'intero-mode))
#+END_SRC

=prettify-symbols= replaces ASCII characters with a unicode representation of
them. For example, on Lisp dialects, the word "/lambda/" is replaced by the
actual greek letter /λ/. It is also possible to add your own mappings like so:

/Ps.: This is not going to be tangled/

#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (push '(">=" . ?≥) prettify-symbols-alist)
            (push '("<=" . 2264) prettify-symbols-alist)))

;; you can use either the ?char or the char code; for example, ?≥ is the same as
;; 2265
#+END_SRC

These are some eye candy packages. If you're interested in any of them just look
them up on your favorite search engine.

#+BEGIN_SRC emacs-lisp :tangle config/init-eyecandy.el
  (when (fboundp 'global-prettify-symbols-mode)
    (global-prettify-symbols-mode))

  (/boot/delayed-init
   (require-package 'color-identifiers-mode)
   (global-color-identifiers-mode)
   (diminish 'color-identifiers-mode))

  (require-package 'highlight-symbol)
  (setq highlight-symbol-idle-delay 0.3)
  (add-hook 'prog-mode-hook #'highlight-symbol-mode)

  (require-package 'highlight-numbers)
  (add-hook 'prog-mode-hook #'highlight-numbers-mode)

  (require-package 'highlight-quoted)
  (add-hook 'prog-mode-hook #'highlight-quoted-mode)

  (require-package 'page-break-lines)
  (global-page-break-lines-mode)

  (provide 'init-eyecandy)
#+END_SRC

** Misc
:PROPERTIES:
:CUSTOM_ID: cfg-misc
:END:

This section is some miscellaneous stuff.

A package to make dired more beautiful.

#+BEGIN_SRC emacs-lisp :tangle config/init-misc.el
  (after 'dired
    (require-package 'dired-k)
    (setq dired-k-style 'git)
    (setq dired-k-human-readable t)
    (add-hook 'dired-initial-position-hook #'dired-k))
#+END_SRC

A tree to visualize modifications on the file and go back to previous states.

#+BEGIN_SRC emacs-lisp :tangle config/init-misc.el
  (require-package 'undo-tree)
  (setq undo-tree-auto-save-history t)
  (setq undo-tree-enable-undo-in-region nil)
  (setq undo-tree-history-directory-alist
        `(("." . ,(concat dotemacs-cache-directory "undo/"))))
  (setq undo-tree-visualizer-timestamps t)
  (setq undo-tree-visualizer-diff t)
  (global-undo-tree-mode)
#+END_SRC

Jump to definition on Emacs. It doesn't need TAGS file or anything like this, it
only uses =ag= or =grep= or =ripgrep= or =rg=.

#+BEGIN_SRC emacs-lisp :tangle config/init-misc.el
  (require-package 'dumb-jump)
  (after [evil dumb-jump]
         (defadvice dumb-jump-go (before dotemacs activate)
           (evil-set-jump)))
#+END_SRC

=ag= is a very fast code searching tool.

#+BEGIN_SRC emacs-lisp :tangle config/init-misc.el
  (when (executable-find "ag")
    (require-package 'ag)
    (require 'ag)
    (setq ag-highlight-search t)
    (setq ag-ignore-list dotemacs-globally-ignored-directories)
    (add-hook 'ag-mode-hook (lambda () (toggle-truncate-lines t))))
#+END_SRC

=expand-region= let's you keep expanding the selection. =aggressive-indent= is a
package to indent, you want it or not, your code.

#+BEGIN_SRC emacs-lisp :tangle config/init-misc.el
  (require-package 'expand-region)

  (require-package 'aggressive-indent)
  (require 'aggressive-indent)
  (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
  (add-hook 'lisp-mode-hook #'aggressive-indent-mode)
#+END_SRC

=popwin= is used to better manage pop-up windows. =restart-emacs= makes it
easier to restart your config and load new code snippets.

#+BEGIN_SRC emacs-lisp :tangle config/init-misc.el
  (require-package 'popwin)
  (require 'popwin)
  (push '(compilation-mode :noselect t) popwin:special-display-config)
  (popwin-mode)

  (provide 'init-misc)
#+END_SRC

