init.org
** =eshell=
:PROPERTIES:
   :CUSTOM_ID: cfg-eshell
   :END:

=eshell= is the Emacs shell, a shell written in Emacs Lisp. It is great to
execute commands while on Emacs. I like it better than =ansi-term= or =term=,
but I don't use it as my main shell (and it is not intended to, even though some
people do).

#+BEGIN_SRC emacs-lisp :tangle config/init-eshell.el
  (defvar dotemacs-eshell/prompt-git-info
    (executable-find "git")
    "Full path for the `git' executable.")

  (defvar dotemacs-eshell/visual-commands
    '("ssh" "top" "tail" "less")
    "Command that present their output in a visual fashion.")

  (defadvice eshell/exit (before dotemacs activate)
    "After exiting `eshell', remove its window."
    (delete-window))
#+END_SRC

Some variable configuration.

#+BEGIN_SRC emacs-lisp :tangle config/init-eshell.el
  (setq eshell-directory-name (concat dotemacs-cache-directory "eshell"))
  (setq eshell-buffer-maximum-lines 20000)
  (setq eshell-scroll-to-bottom-on-input 'this)
  (setq eshell-buffer-shorthand t)
  (setq eshell-aliases-file (concat user-emacs-directory "alias"))
  (setq eshell-glob-case-insensitive nil)
  (setq eshell-error-if-no-glob t)
  (setq eshell-history-size (* 10 1024))
  (setq eshell-hist-ignoredups t)
  (setq eshell-cmpl-ignore-case t)
#+END_SRC

This is the prompt function for =eshell= (usually called =$PS1= on =bash= or
=zsh=). I'm not currently using this, because it made =eshell= a little slow and
I didn't like it, but I decided to leave it here if anyone wants to try it out.

#+BEGIN_SRC emacs-lisp :tangle no
  (setq eshell-prompt-function
        (lambda ()
          "The function to generate `eshell's prompt."
          (concat
           (propertize (abbreviate-file-name (eshell/pwd)) 'face 'eshell-prompt)
           (when (and dotemacs-eshell/prompt-git-info
                      (fboundp #'vc-git-branches))
             (let ((branch (car (vc-git-branches))))
               (when branch
                 (concat
                  (propertize " [" 'face 'font-lock-keyword-face)
                  (propertize branch 'face 'font-lock-function-name-face)
                  (let* ((status (shell-command-to-string "git status --porcelain"))
                         (parts (split-string status "\n" t " "))
                         (states (mapcar #'string-to-char parts))
                         (added (count-if (lambda (char) (= char ?A)) states))
                         (modified (count-if (lambda (char) (= char ?M)) states))
                         (deleted (count-if (lambda (char) (= char ?D)) states)))
                    (when (> (+ added modified deleted) 0)
                      (propertize
                       (format " +%d ~%d -%d" added modified deleted)
                       'face 'font-lock-comment-face)))
                  (propertize "]" 'face 'font-lock-keyword-face)))))
           (propertize " $ " 'face 'font-lock-constant-face))))
#+END_SRC

If you have fortune installed, show a fortune every time =eshell= is opened.

#+BEGIN_SRC emacs-lisp :tangle config/init-eshell.el
  (when (executable-find "fortune")
    (defadvice eshell (before dotemacs activate)
      (setq eshell-banner-message
            (concat (shell-command-to-string "fortune") "\n"))
      "Display a little `fortune' at `eshell's startup."))
#+END_SRC

Functions defined as =eshell/name-of-function= are functions executed on
=eshell= whenever you type =name-of-function= and press Enter.

#+BEGIN_SRC emacs-lisp :tangle config/init-eshell.el
  (defun eshell/ff (&rest args)
    "Opens a file in emacs."
    (when (not (null args))
      (mapc #'find-file (mapcar #'expand-file-name
                                (eshell-flatten-list (reverse args))))))

  (defun eshell/h ()
    "Quickly run a previous command."
    (insert (completing-read
             "Run previous command: "
             (delete-dups (ring-elements eshell-history-ring))
             nil
             t))
    (eshell-send-input))

  (defun eshell/tramp (&rest args)
    "Use tramp as a eshell command."
    (insert (apply #'format "cd /ssh:%s:\\~/" args))
    (eshell-send-input))
#+END_SRC

After =em-term= is loaded, add the new visual commands to the list of visual
commands. Also, when on =eshell=, =gst= opens up =magit=.

#+BEGIN_SRC emacs-lisp :tangle config/init-eshell.el
  (after 'em-term
    (dolist (cmd dotemacs-eshell/visual-commands)
      (add-to-list 'eshell-visual-commands cmd)))

  (after "magit-autoloads"
    (defun eshell/gst (&rest args)
      (magit-status (pop args) nil)
      (eshell/echo)))
#+END_SRC

This function splits the current window in half, opening a new =eshell= instance
on the lower half of the window. It also =cd='s into the current working
directory and renames the =eshell= buffer to =*eshell: directory*= and sends an
=ls= as output as soon as it starts.

#+BEGIN_SRC emacs-lisp :tangle config/init-eshell.el
  (defun /eshell/new-window ()
    "Opens up a new shell in the directory associated with the
    current buffer's file. The eshell is renamed to match that
    directory to make multiple eshell windows easier."
    (interactive)
    (let* ((parent (if (buffer-file-name)
                       (file-name-directory (buffer-file-name))
                     default-directory))
           (height (/ (window-total-height) 2))
           (name   (car (last (split-string parent "/" t)))))
      (split-window-vertically (- height))
      (other-window 1)
      (eshell "new")
      (rename-buffer (concat "*eshell: " name "*"))

      (insert (concat "ls"))
      (eshell-send-input)))

  (provide 'init-eshell)
#+END_SRC

** Version Control System
   :PROPERTIES:
   :CUSTOM_ID: cfg-vcs
   :END:

Configuration regarding the VCS. It is based on =magit=, one of the best Emacs
packages and a reason a lot of people stick to it (of course, if they use git).

#+BEGIN_SRC emacs-lisp :tangle config/init-vcs.el
  (setq vc-make-backup-files t)

  (when (executable-find "git")
    (add-hook 'git-commit-mode-hook
              (lambda ()
                (interactive)
                (next-line)))

    (require-package 'magit)
    (require 'magit)

    (setq magit-section-show-child-couno t)
    (setq magit-diff-arguments '("--histogram"))
    (setq magit-ediff-dwim-show-on-hunks t)
    (setq magit-display-buffer-function #'magit-display-buffer-traditional)

    (add-hook 'magit-mode-hook #'hl-line-mode)

    (require-package 'magit-todos)
    (add-hook 'prog-mode-hook #'hl-todo-mode)
    (setq magit-todos-fontify-org nil)
    (when (executable-find "rg")
      (setq magit-todos-scanner 'magit-todos--scan-with-rg))
    (magit-todos-mode t))

  (/boot/lazy-major-mode "\\.gitignore$" 'gitignore-mode)
  (/boot/lazy-major-mode "\\.gitattributes$" 'gitattributes-mode)

  (after [evil diff-mode]
    (evil-define-key 'normal diff-mode diff-mode-map
      "j" #'diff-hunk-next
      "k" #'diff-hunk-prev))
  (after [evil vc-annotate]
    (evil-define-key 'normal vc-annotate-mode-map
      (kbd "M-p") #'vc-annotate-prev-revision
      (kbd "M-n") #'vc-annotate-next-revision
      "l" #'vc-annotate-show-log-revision-at-line))

  (provide 'init-vcs)
#+END_SRC

** Flycheck
   :PROPERTIES:
   :CUSTOM_ID: cfg-flycheck
   :END:

This is a syntax checking package for Emacs. It is a pretty simple
configuration. I added some bindings to help out with =evil-mode= and I like to
have it always on.

#+BEGIN_SRC emacs-lisp :tangle config/init-flycheck.el
  (require-package 'flycheck)
  (require 'flycheck)

  (setq flycheck-standard-error-navigation t)

  (after 'web-mode
         (flycheck-add-mode 'javascript-eslint 'web-mode))

  (add-hook 'after-init-hook #'global-flycheck-mode)

  (after [evil flycheck]
    (evil-define-key 'normal flycheck-error-list-mode-map
      "j" #'flycheck-error-list-next-error
      "k" #'flycheck-error-list-previous-error))

  (defun /flycheck/advice/next-error-find-buffer (orig-func &rest args)
    (let* ((special-buffers
            (cl-loop for buffer in (mapcar #'window-buffer (window-list))
                     when (with-current-buffer buffer
                            (and
                             (eq (get major-mode 'mode-class) 'special)
                             (boundp 'next-error-function)))
                     collect buffer))
           (first-special-buffer (car special-buffers)))
      (if first-special-buffer
          first-special-buffer
        (apply orig-func args))))

  (advice-add #'next-error-find-buffer :around #'/flycheck/advice/next-error-find-buffer)

  (provide 'init-flycheck)
#+END_SRC

** Flyspell

Flyspell highlights incorrect words as soon as they are completed or as soon as
the [[https://www.emacswiki.org/emacs/TextCursor][TextCursor]] hits a new word.

#+BEGIN_SRC emacs-lisp :tangle config/init-flyspell.el
  (add-hook 'prog-mode-hook #'flyspell-prog-mode)
  (add-hook 'text-mode-hook #'turn-on-flyspell)
#+END_SRC

** Auxiliary modes
   :PROPERTIES:
   :CUSTOM_ID: cfg-aux-modes
   :END:

Some major modes that are not installed by default.

#+BEGIN_SRC emacs-lisp :tangle config/init-auxiliary-modes.el
  (/boot/lazy-major-mode "\\.\\(md\\|markdown\\)$" 'markdown-mode)
  (/boot/lazy-major-mode "\\.toml$" 'toml-mode)
  (/boot/lazy-major-mode "\\.yaml$" 'yaml-mode)
  (/boot/lazy-major-mode "\\.json$" 'json-mode)
  (/boot/lazy-major-mode "\\.vim$" 'vimrc-mode)
  (/boot/lazy-major-mode "\\.lua$" 'lua-mode)
  (/boot/lazy-major-mode "\\.csv$" 'csv-mode)
  (/boot/lazy-major-mode "\\.?cron\\(tab\\)?\\'" 'crontab-mode)

  (provide 'init-auxiliary-modes)
#+END_SRC

** Company
   :PROPERTIES:
   :CUSTOM_ID: cfg-company
   :END:

This is the auto-completion engine I use. Configuration is pretty straight
forward. There are some other packages for each language. Those packages are
configured and installed on the language's or mode's config section.

#+BEGIN_SRC emacs-lisp :tangle config/init-company.el
  (require-package 'company)
  (require 'company)

  (setq company-idle-delay 0.5)
  (setq company-minimum-prefix-length 1)
  (setq company-tooltip-limit 20)
  (setq company-auto-complete 'company-explicit-action-p)

  (setq company-dabbrev-downcase nil)
  (setq company-dabbrev-ignore-case t)

  (setq company-dabbrev-code-ignore-case t)
  (setq company-dabbrev-code-everywhere t)

  (setq company-global-modes
        '(not
          eshell-mode comint-mode text-mode erc-mode))

  (global-company-mode)

  (after 'yasnippet
    (setq company-backends
          (mapcar
           (lambda (backend)
             (if (and (listp backend) (member 'company-yasnippet backend))
                 backend
               (append (if (consp backend) backend (list backend))
                       '(:with company-yasnippet))))
           company-backends)))

  (provide 'init-company)
#+END_SRC

