init.org
** Yasnippet
   :PROPERTIES:
   :CUSTOM_ID: cfg-yasnippet
   :END:

And this is my snippet package. The configuration is even smaller.

#+BEGIN_SRC emacs-lisp :tangle config/init-yasnippet.el
  (require-package 'yasnippet)
  (require 'yasnippet)

  (after 'yasnippet
    (require-package 'yasnippet-snippets)
    (require-package 'yasnippet-classic-snippets))

  (require 'yasnippet)

  (setq yas-fallback-behavior 'return-nil)
  (setq yas-also-auto-indent-first-line t)
  (setq yas-prompt-functions '(yas-ido-prompt yas-completing-prompt))

  (yas-global-mode t)

  (yas-load-directory (concat user-emacs-directory "snippets"))

  (provide 'init-yasnippet)
#+END_SRC

** Projectile
   :PROPERTIES:
   :CUSTOM_ID: cfg-projectile
   :END:

This package is amazing at dealing with projects.

#+BEGIN_SRC emacs-lisp :tangle config/init-projectile.el
  (require-package 'projectile)
  (require 'projectile)

  (setq projectile-cache-file
        (concat dotemacs-cache-directory "projectile.cache"))
  (setq projectile-known-projects-file
        (concat dotemacs-cache-directory "projectile-bookmarks.eld"))
  (setq projectile-indexing-method 'alien)
  (setq projectile-enable-caching t)
  (setq projectile-completion-system 'helm)
#+END_SRC

[[#cfg-helm][Helm]] also integrates very well with Projectile, making it one of the most useful
combos of my configuration.

#+BEGIN_SRC emacs-lisp :tangle config/init-projectile.el
  (after 'helm-projectile
    (add-to-list 'helm-projectile-sources-list
                 'helm-source-projectile-recentf-list))

  (projectile-mode)
#+END_SRC

Here we add the globally ignored directories that we store in a variable to the
projectile ignored directories. Also, pass as an argument to the searchers the
ignored directories.

#+BEGIN_SRC emacs-lisp :tangle config/init-projectile.el
  (dolist (dir dotemacs-globally-ignored-directories)
    (add-to-list 'projectile-globally-ignored-directories dir))

  (cond
   ((executable-find "ag")
    (setq projectile-generic-command
          (concat "ag -0 -l --nocolor"
                  (mapconcat #'identity
                             (cons "" projectile-globally-ignored-directories)
                             " --ignore-dir="))))
   ((executable-find "ack")
    (setq projectile-generic-command
          (concat "ack -f --print0"
                  (mapconcat #'identity
                             (cons "" projectile-globally-ignored-directories)
                             " --ignore-dir=")))))

  (provide 'init-projectile)
#+END_SRC

** Org

I use =org-mode= a lot (my whole configuration file is written in =org-mode=).
It is capable of storing notes, taking care of TODOs, being your agenda, store
contacts (all of that with sync capacities), evaluating LaTeX code, automatic
blog posting, etc...

Here we set some default variables. And create the default org directory if it
is not already created.

#+BEGIN_SRC emacs-lisp :tangle config/init-org.el
  (after 'org
    (setq org-directory (concat (getenv "HOME") "/docs/org"))

    (unless (file-directory-p org-directory)
      (unless (/boot/create-non-existent-directory org-directory)
      (let ((default-org (concat (getenv "HOME") "/Documents/Org")))
        (if (y-or-n-p
         (format "Failed to create `%s', use the default directory for org files [%s]?"
                 org-directory default-org))
            (progn (make-directory (concat (getenv "HOME") "/Documents/Org") t)
                   (setq org-directory (concat (getenv "HOME") "/Documents")))
          (error (concat "Couldn't load the configuration for org-mode. Try again or remove the file init-org.el from the config folder"))))))

    (defvar dotemacs-org/journal-file (concat org-directory "/journal.org")
      "The path to the file where you want to make journal entries.")

    (defvar dotemacs-org/inbox-file (concat org-directory "/inbox.org")
      "The path to the file where to capture notes.")

    (unless (file-exists-p org-directory)
      (make-directory org-directory))

    (setq org-default-notes-file (expand-file-name dotemacs-org/inbox-file))
    (setq org-log-done t)
    (setq org-log-into-drawer t)

    (setq org-startup-indented t)
    (setq org-indent-indentation-per-level 2)
    (setq org-src-fontify-natively nil)
#+END_SRC

Org is also a great way o handling TODO's, here we set some configuration and
variables to work with TODO's better. The =org-agenda-files= is set to be the
same as the =org-directory=. The =org-capture-templates= are the how to display
each entry of the possible TODO entries in the agenda (to learn more about the
agenda, visit [[https://orgmode.org/manual/Agenda-views.html#Agenda-views][the org manual on the agenda section]]). After that there are some
variables to help with TODO's.

#+BEGIN_SRC emacs-lisp :tangle config/init-org.el
    (setq org-agenda-files `(,org-directory))
    (setq org-capture-templates
          '(("t" "Todo" entry
             (file+headline (expand-file-name dotemacs-org/inbox-file) "INBOX")
             "* TODO %?\n%U\n%a\n")
            ("n" "Note" entry
             (file+headline (expand-file-name dotemacs-org/inbox-file) "NOTES")
             "* %? :NOTE:\n%U\n%a\n")
            ("m" "Meeting" entry
             (file (expand-file-name dotemacs-org/inbox-file))
             "* MEETING %? :MEETING:\n%U")
            ("j" "Journal" entry
             (file+datetree (expand-file-name dotemacs-org/journal-file))
             "* %U\n** %?")))

    (setq org-use-fast-todo-selection t)
    (setq org-treat-S-cursor-todo-selection-as-state-change nil)
    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n@)" "|" "DONE(d@)")
            (sequence "WAITING(w@/!)" "|" "CANCELLED(c@/!)")))
#+END_SRC

This first variable defines what triggers an state change. After that there is
some variables that you could look up on =C-h v=. The hook after the variables
makes sure that all the inline images are redisplayed after the execution of an
src block. Lastly, the [[https://github.com/astahlman/ob-async][=ob-async=]] package allows for async execution of src
blocks if the block has =:async= in its header.

#+BEGIN_SRC emacs-lisp :tangle config/init-org.el
    (setq org-todo-state-tags-triggers
          ' (("CANCELLED" ("CANCELLED" . t))
             ("WAITING" ("WAITING" . t))
             ("TODO" ("WAITING") ("CANCELLED"))
             ("NEXT" ("WAITING") ("CANCELLED"))
             ("DONE" ("WAITING") ("CANCELLED"))))

    (setq org-refile-targets '((nil :maxlevel . 9)
                               (org-agenda-files :maxlevel . 9)))
    (setq org-refile-use-outline-path 'file)
    (setq org-outline-path-complete-in-steps nil)
    (setq org-completion-use-ido t)

    (add-hook 'org-babel-after-execute-hook #'org-redisplay-inline-images)

    (require-package 'ob-async)
    (require 'ob-async))

  (provide 'init-org)
#+END_SRC

