init.org
** Proof General

[[https://proofgeneral.github.io/][Proof General]] is a generic front-end for /proof assistants/ (also known as
interactive /theorem provers/). It is installed separately via =git= and
mantained up to date via [[https://github.com/dimitri/el-get][=el-get=]].

On this first part we add to the =load-path= the path to =el-get= and
=proof-general=, so that we can load them with =require=.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
  (add-to-list
   'load-path (concat user-emacs-directory "el-get/el-get"))
  (add-to-list
   'load-path (concat user-emacs-directory "el-get/proof-general"))
#+END_SRC

This is the =el-get= config. First we install it if not already installed and
then setup a custom recipe for =proof-general=, because it is not one of the pre
installed recipes (for more information, see =el-get's= info page or the [[https://github.com/dimitri/el-get][README]]
on their github). We could also specify how to build ProofGeneral, but =el-get=
already does a wonderful job on figuring that out.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
  (require-package 'el-get)
  (require 'el-get)

  (setq el-get-sources
        '((:name proof-general
                 :type github
                 :pkgname "ProofGeneral/PG"
                 :url "https://github.com/ProofGeneral/PG.git")))
#+END_SRC

Here we check if ProofGeneral is installed or not by trying to load it and
specifying the full path it should be installed at.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
  (unless (load (concat user-emacs-directory
                        "el-get/proof-general/generic/proof-site.el") 'noerror)
#+END_SRC

In case it isn't installed, we set some local variables to use to install it.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
    (let* ((el-get-root
            (file-name-as-directory
             (or (bound-and-true-p el-get-dir)
                 (concat (file-name-as-directory user-emacs-directory)
                         "el-get"))))
           (package "proof-general")
           (buf (switch-to-buffer (format "*%s bootstrap*" package)))
           (pkgdir (file-name-as-directory (concat el-get-root package)))
           (git (or (executable-find "git")
                    (error "Unable to find `git'")))
           (url "https://github.com/ProofGeneral/PG.git")
           (default-directory el-get-root)
           (process-connection-type nil)) ; use pipe instead of pty
#+END_SRC

This next part is to clone ProofGeneral into the specified path =pkgdir= above.
if it fails, throw an error.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
      ;; create directory if it doesn't exist
      (unless (file-directory-p el-get-root)
        (make-directory el-get-root))

      ;; clone the package (in this case, proof general)
      (unless (zerop (funcall #'call-process git nil `(,buf t) 'display
                              "--no-pager" "clone" "-v" url package))
        (error "Couldn't clone \"%s\" from the Git repositorty: %s" package url))
#+END_SRC

If the cloning of the repository was successful, add =proof-general= to the
=load-path= and load its main file. Last, but not least, sync it with =el-get=.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
      (add-to-list 'load-path pkgdir)
      (load-file (concat pkgdir "generic/proof-site.el"))
      (load 'proof-site)
      (insert (format "Package \"%s\" loaded!" package))

  (el-get 'sync 'proof-general)))
#+END_SRC

Here is the actual configuration for ProofGeneral. First there are some settings
and then we load it.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
  (setq proof-strict-read-only 'retract)
  (setq proof-three-window-mode-policy 'smart)
  (setq proof-indent (symbol-value 'tab-width))
  (setq proof-splash-enable nil)
  (setq proof-script-fly-past-comments t)

  (/boot/lazy-major-mode "\\.v$" 'coq-mode)

  (require 'proof-site)
#+END_SRC

I also created an ex command for evil (the commands you type when you press =:=)
and I didn't really liked to press =C-c C-n= or =C-c C-u= all the time to
evaluate or undo the commands, so I remapped it to =M-n= and =M-p= in both
normal and insert mode.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
  (after 'proof-site
    (after 'evil
      (evil-ex-define-cmd "pr[ove]" 'proof-goto-point)
      (evil-define-key 'normal proof-mode-map (kbd "M-n")
        'proof-assert-next-command-interactive)
      (evil-define-key 'normal proof-mode-map (kbd "M-p")
        'proof-undo-last-successful-command)
      (evil-define-key 'normal proof-mode-map (kbd "C-n")
        'pg-next-input)
      (evil-define-key 'normal proof-mode-map (kbd "C-p")
        'pg-previous-input)
      (evil-define-key 'insert proof-mode-map (kbd "M-n")
        'proof-assert-next-command-interactive)
      (evil-define-key 'insert proof-mode-map (kbd "M-p")
        'proof-undo-last-successful-command)
      (evil-define-key 'insert proof-mode-map (kbd "C-n")
        'pg-next-input)
      (evil-define-key 'insert proof-mode-map (kbd "C-p")
        'pg-previous-input))
#+END_SRC

ProofGeneral disables =undo-tree-mode= and has it's own =pg-protected-undo=
function, that works like Emacs' undo and redo (with the difference that it
avoids breaking the locked region). I prefer to have =undo-tree's= undo and redo
(Emacs doesn't have redo, so every time I tried typing =C-r=, vim's and evil's
command for redo, it would give me an error), so I enable =undo-tree-mode=.
Also, since I use =yasnippet= I don't need =holes-mode=, so I also disable it.
The last line sync's ProofGeneral using =el-get=.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
  (add-hook
   'proof-mode-hook
   (lambda ()
     "Enable `undo-tree-mode', disable `holes-mode' and enable
    `flyspell-prog-mode' in Proof General's modes"
     (flyspell-prog-mode)
     (undo-tree-mode t)
     (holes-mode -1)))
#+END_SRC

=company-coq= is a wonderful package to work with the Coq language. It adds many
features and improves many of ProofGeneral's defaults. The last line sync's
ProofGeneral using =el-get=.

#+BEGIN_SRC emacs-lisp :tangle config/init-pg.el
    (require-package 'company-coq)
    (setq company-coq-disabled-features '(prettify-symbols smart-subscripts))
    (add-hook 'coq-mode-hook #'company-coq-mode)
    (add-hook 'company-coq-mode-hook
              (lambda ()
                (setq company-idle-delay 0.5)
                (setq coq-one-command-per-line nil))))

  (el-get 'sync 'proof-general)

  (provide 'init-pg)
#+END_SRC

** PDF

Emacs has its own PDF viewer, called =docview= (more on it on the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Document-View.html][manual]]). But
there is a lot of cool features missing. That's why I use <<target>>[[https://github.com/politza/pdf-tools][=pdf-tools=]].

=pdf-tools= configuration is pretty simple, but there is a lot of system
dependencies since it uses a server, outside Emacs, to render the PDF's as PNG
images, so that Emacs can display it in a better quality, so make sure to read
its README in the [[target][link above]].

#+BEGIN_SRC emacs-lisp :tangle config/init-pdf.el
  (/boot/delayed-init
   (require-package 'pdf-tools)
   (require 'pdf-tools)

   (unless (pdf-info-running-p)
     (pdf-tools-install)))

  ;; add this in the LaTeX part later to revert the pdf after TeX finished
  ;; compiling
  ;; (add-hook 'TeX-after-compilation-finished-functions
  ;;           #'TeX-revert-document-buffer)
#+END_SRC
